Catalogs/Организации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Организации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипОрганизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРуководителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТипыОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыОрганизаций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныйПредприниматель</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Организации/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура УстановитьВидимостьИДлинуИНН()
	
	ЭтоЮрЛицо = (Объект.ТипОрганизации = ПредопределенноеЗначение("Перечисление.ТипыОрганизаций.ЮридическоеЛицо"));
	Элементы.ГлавныйБухгалтер.Видимость = ЭтоЮрЛицо;
	Если ЗначениеЗаполнено(Объект.ИНН) Тогда
		Если ЭтоЮрЛицо И СтрДлина(Объект.ИНН) <> 10 Тогда
			ОбщегоНазначения.СообщитьПользователю(Нстр("ru='Число символов поля ИНН для Юр.лица должна составлять 10 символов!'"),,"Объект.ИНН");
			Отказ = Истина;
		ИначеЕсли НЕ ЭтоЮрЛицо И СтрДлина(Объект.ИНН) <> 12 Тогда
			ОбщегоНазначения.СообщитьПользователю(Нстр("ru='Число символов поля ИНН для ИП должна составлять 12 символов!'"),,"Объект.ИНН");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИННПриИзменении(Элемент)
	
	УстановитьВидимостьИДлинуИНН();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипОрганизацииПриИзменении(Элемент)
	
	УстановитьВидимостьИДлинуИНН();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьИДлинуИНН();
	
КонецПроцедуры
